Задача 18: Напишите программу, которая по
заданному номеру четверти, показывает диапазон
возможных координат точек в этой четверти (x и y).

 Console.WriteLine("Укажите четверть");
 int x = int.Parse(Console.ReadLine());
 if (x == 1){
    Console.WriteLine("x > 0; y > 0");  
 }
 else if (x == 2){
    Console.WriteLine("x < 0; y > 0");  
 }
  else if (x == 3){
    Console.WriteLine("x < 0; y < 0");  
 }
  else if (x == 4){
    Console.WriteLine("x > 0; y < 0");  
 }



Задача 21: Напишите программу, которая
принимает на вход координаты двух точек и
находит расстояние между ними в 2D
пространстве.

A (3,6); B (2,1) -> 5,09
A (7,-5); B (1,-1) -> 7,21

Console.WriteLine ("Введите координату x первой точки ");
int x1 = int.Parse (Console.ReadLine());

Console.WriteLine ("Введите координату y первой точки ");
int y1 = int.Parse (Console.ReadLine());

Console.WriteLine ("Введите координату x второй точки ");
int x2 = int.Parse (Console.ReadLine());

Console.WriteLine ("Введите координату y второй точки ");
int y2 = int.Parse (Console.ReadLine());


double a = Math.Sqrt(Math.Pow(x1 - x2,2) + Math.Pow(y1 - y2,2));

Console.WriteLine(Math.Round(a,2));


Задача 22: Напишите программу, которая
принимает на вход число (N) и выдаёт таблицу
квадратов чисел от 1 до N.
5 -> 1, 4, 9, 16, 25.
2 -> 1,4

Console.Write("Введите N ");
int N = int.Parse(Console.ReadLine());
 int a = 1;

 while (a <= N)
 {
    Console.Write(Math.Pow(a,2) + " ");
    a++;
 }

